Revit 2024 API
ElementMulticategoryFilter Members
The ElementMulticategoryFilter type exposes the following members.
Constructors
Name | Description
ElementMulticategoryFilter(ICollection<BuiltInCategory>)
 Constructs a new instance of a filter to match elements by built-in category.
ElementMulticategoryFilter(ICollection<ElementId>)
 Constructs a new instance of a filter to find elements whose category matches any of a given set of categories.
ElementMulticategoryFilter(ICollection<BuiltInCategory>, Boolean)
 Constructs a new instance of a filter to match elements by built-in category, with the option to match all elements which are not of the given category.
ElementMulticategoryFilter(ICollection<ElementId>, Boolean)
 Constructs a new instance of a filter to find elements whose category matches any of a given set of categories, with the option to instead match elements which are not of the given categories.
Methods
Name | Description
Dispose |  (Inherited from ElementFilter.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCategoryIds
 Gets the category ids assigned to this filter.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
See Also
ElementMulticategoryFilter Class
Autodesk.Revit.DB Namespace